/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   render.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ptopping <ptopping@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/09/17 17:51:37 by ptopping          #+#    #+#             */
/*   Updated: 2022/09/17 18:32:06 by ptopping         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "cub3D.h"

int draw_lines(t_data *data)
{
    //пересчитать какую то хуйню и отрисовать draw_line
}

int draw_image(t_data *data)
{
    steps(data);
    dda(data,x);//внутри dda рассчитывается необходимое и внутри же вызывается draw_lines
    
}

int render(t_data *data)
{
    //удалить->пересчитать->очистить заново
    draw_image(data);
}